[
  {
    "Aatrox": {
      "display_name": "Aatrox",
      "title": ", The Darkin Blade",
      "lore_snippet": "Once honored defenders of Shurima against the Void, Aatrox and his brethren would eventually become an even greater threat to Runeterra, and were defeated only by cunning mortal sorcery. But after centuries of imprisonment, Aatrox was the first to find freedom once more, corrupting and transforming those foolish enough to try and wield the magical weapon that contained his essence. Now, with stolen flesh, he walks Runeterra in a brutal approximation of his previous form, seeking an apocalyptic and long overdue vengeance.",
      "type": "Physical"
    }
  },
  {
    "Ahri": {
      "display_name": "Ahri",
      "title": ", The Nine-Tailed Fox",
      "lore_snippet": "Innately connected to the latent power of Runeterra, Ahri is a vastaya who can reshape magic into orbs of raw energy. She revels in toying with her prey by manipulating their emotions before devouring their life essence. Despite her predatory nature, Ahri retains a sense of empathy as she receives flashes of memory from each soul she consumes.",
      "type": "Magic"
    }
  },
  {
    "Akali": {
      "display_name": "Akali",
      "title": ", The Rogue Assasin",
      "lore_snippet": "Abandoning the Kinkou Order and her title of the Fist of Shadow, Akali now strikes alone, ready to be the deadly weapon her people need. Though she holds onto all she learned from her master Shen, she has pledged to defend Ionia from its enemies, one kill at a time. Akali may strike in silence, but her message will be heard loud and clear: fear the assassin with no master.",
      "type": "Mixed"
    }
  },
  {
    "Alistar": {
      "display_name": "Alistar",
      "title": ", The Minotaur",
      "lore_snippet": "Always a mighty warrior with a fearsome reputation, Alistar seeks revenge for the death of his clan at the hands of the Noxian empire. Though he was enslaved and forced into the life of a gladiator, his unbreakable will was what kept him from truly becoming a beast. Now, free of the chains of his former masters, he fights in the name of the downtrodden and the disadvantaged, his rage as much a weapon as his horns, hooves and fists.\n",
      "type": "Magic"
    }
  },
  {
    "Amumu": {
      "display_name": "Amumu",
      "title": ", The Sad Mummy",
      "lore_snippet": "Legend claims that Amumu is a lonely and melancholy soul from ancient Shurima, roaming the world in search of a friend. Doomed by an ancient curse to remain alone forever, his touch is death, his affection ruin. Those who claim to have seen him describe a living cadaver, small in stature and wrapped in creeping bandages. Amumu has inspired myths, songs, and folklore told and retold for generations—such that it is impossible to separate truth from fiction.\n",
      "type": "Magic"
    }
  },
  {
    "Anivia": {
      "display_name": "Anivia",
      "title": ", The Cryophoenix",
      "lore_snippet": "Anivia is a benevolent winged spirit who endures endless cycles of life, death, and rebirth to protect the Freljord. A demigod born of unforgiving ice and bitter winds, she wields those elemental powers to thwart any who dare disturb her homeland. Anivia guides and protects the tribes of the harsh north, who revere her as a symbol of hope, and a portent of great change. She fights with every ounce of her being, knowing that through her sacrifice, her memory will endure, and she will be reborn into a new tomorrow.\n",
      "type": "Magic"
    }
  },
  {
    "Annie": {
      "display_name": "Annie",
      "title": ", The Dark Child",
      "lore_snippet": "Dangerous, yet disarmingly precocious, Annie is a child mage with immense pyromantic power. Even in the shadows of the mountains north of Noxus, she is a magical outlier. Her natural affinity for fire manifested early in life through unpredictable, emotional outbursts, though she eventually learned to control these “playful tricks.” Her favorite includes the summoning of her beloved teddy bear, Tibbers, as a fiery protector. Lost in the perpetual innocence of childhood, Annie wanders the dark forests, always looking for someone to play with.\n\n",
      "type": "Magic"
    }
  },
  {
    "Ashe": {
      "display_name": "Ashe",
      "title": ", The Frost Archer",
      "lore_snippet": "Iceborn warmother of the Avarosan tribe, Ashe commands the most populous horde in the north. Stoic, intelligent, and idealistic, yet uncomfortable with her role as leader, she taps into the ancestral magics of her lineage to wield a bow of True Ice. With her people’s belief that she is the mythological hero Avarosa reincarnated, Ashe hopes to unify the Freljord once more by retaking their ancient, tribal lands.\n",
      "type": "Physical"
    }
  },
  {
    "Aurelion Sol": {
      "display_name": "Aurelion Sol",
      "title": ", The Star Forger",
      "lore_snippet": "Aurelion Sol once graced the vast emptiness of the cosmos with celestial wonders of his own devising. Now, he is forced to wield his awesome power at the behest of a space-faring empire that tricked him into servitude. Desiring a return to his star-forging ways, Aurelion Sol will drag the very stars from the sky, if he must, in order to regain his freedom.\n",
      "type": "Magic"
    }
  },
  {
    "Azir": {
      "display_name": "Azir",
      "title": ", The Emperor of the Sands",
      "lore_snippet": "Azir was a mortal emperor of Shurima in a far distant age, a proud man who stood at the cusp of immortality. His hubris saw him betrayed and murdered at the moment of his greatest triumph, but now, millennia later, he has been reborn as an Ascended being of immense power. With his buried city risen from the sand, Azir seeks to restore Shurima to its former glory.\n",
      "type": "Magic"
    }
  },
  {
    "Bard": {
      "display_name": "Bard",
      "title": ", The Wandering Caretaker",
      "lore_snippet": "Atraveler from beyond the stars, Bard is an agent of serendipity who fights to maintain a balance where life can endure the indifference of chaos. Many Runeterrans sing songs that ponder his extraordinary nature, yet they all agree that the cosmic vagabond is drawn to artifacts of great magical power. Surrounded by a jubilant choir of helpful spirit meeps, it is impossible to mistake his actions as malevolent, as Bard always serves the greater good... in his own odd way.\n",
      "type": "Magic"
    }
  },
  {
    "Blitzcrank": {
      "display_name": "Blitzcrank",
      "title": ", The Great Steam Golem",
      "lore_snippet": "Abehemoth of burnished metal, steam, and crackling electricity, Blitzcrank walks the streets of Zaun in a tireless effort to improve the undercity and give aid to those in need. Created to descend into the most caustic and dangerous of environments in Zaun to dispose of harmful waste, they have evolved beyond the bounds of their original programming, thanks to the genius of their inventor, and the mysterious power of hextech.\n",
      "type": "Magic"
    }
  },
  {
    "Brand": {
      "display_name": "Brand",
      "title": ", The Burning Vengeance",
      "lore_snippet": "Once a tribesman of the icy Freljord named Kegan Rodhe, the creature known as Brand is a lesson in the temptation of greater power. Seeking one of the legendary World Runes, Kegan betrayed his companions and seized it for himself—and, in an instant, the man was no more. His soul burned away, his body a vessel of living flame, Brand now roams Valoran in search of other Runes, swearing revenge for wrongs he could not have suffered in a dozen mortal lifetimes.\n\n",
      "type": "Magic"
    }
  },
  {
    "Braum": {
      "display_name": "Braum",
      "title": ", The Heart of the Freljord",
      "lore_snippet": "Blessed with massive biceps and an even bigger heart, Braum is a beloved hero of the Freljord. Every mead hall north of Frostheld toasts his legendary strength, said to have felled a forest of oaks in a single night, and punched an entire mountain into rubble. Bearing an enchanted vault door as his shield, Braum roams the frozen north sporting a mustachioed smile as big as his muscles—a true friend to all those in need.\n",
      "type": "Magic"
    }
  },
  {
    "Caitlyn": {
      "display_name": "Caitlyn",
      "title": ", The Sheriff of Piltover",
      "lore_snippet": "Renowned as its finest peacekeeper, Caitlyn is also Piltover’s best shot at ridding the city of its elusive criminal elements. She is often paired with Vi, acting as a cool counterpoint to her partner’s more impetuous nature. Even though she carries a one-of-a-kind hextech rifle, Caitlyn’s most powerful weapon is her superior intellect, allowing her to lay elaborate traps for any lawbreakers foolish enough to operate in the City of Progress.\n",
      "type": "Physical"
    }
  },
  {
    "Camille": {
      "display_name": "Camille",
      "title": ", The Steel Shadow",
      "lore_snippet": "Weaponized to operate outside the boundaries of the law, Camille is the Principal Intelligencer of Clan Ferros—an elegant and elite agent who ensures the Piltover machine and its Zaunite underbelly run smoothly. Adaptable and precise, she views sloppy technique as an embarrassment that must be put to order. With a mind as sharp as the blades she bears, Camille's pursuit of superiority through hextech body augmentation has left many to wonder if she is now more machine than human.\n",
      "type": "Physical"
    }
  },
  {
    "Cassiopeia": {
      "display_name": "Cassiopeia",
      "title": ", The Serpent's Embrace",
      "lore_snippet": "Cassiopeia is a deadly creature bent on manipulating others to her will. Youngest and most beautiful daughter of the noble Du Couteau family of Noxus, she ventured deep into the crypts beneath Shurima in search of ancient power. There, she was bitten by a gruesome tomb guardian, whose venom transformed her into a viper-like predator. Cunning and agile, Cassiopeia now slithers under the veil of night, petrifying her enemies with her baleful gaze.\n",
      "type": "Magic"
    }
  },
  {
    "Cho'Gath": {
      "display_name": "Cho'Gath",
      "title": ", The Terror of the Void",
      "lore_snippet": "From the moment Cho’Gath first emerged into the harsh light of Runeterra’s sun, the beast was driven by the most pure and insatiable hunger. A perfect expression of the Void’s desire to consume all life, Cho’Gath’s complex biology quickly converts matter into new bodily growth—increasing its muscle mass and density, or hardening its outer carapace like organic diamond. When growing larger does not suit the Void-spawn’s needs, it vomits out the excess material as razor-sharp spines, leaving prey skewered and ready to feast upon later.\n",
      "type": "Magic"
    }
  },
  {
    "Corki": {
      "display_name": "Corki",
      "title": ", The Daring Bombardier",
      "lore_snippet": "The yordle pilot Corki loves two things above all others: flying, and his glamorous mustache... though not necessarily in that order. After leaving Bandle City, he settled in Piltover and fell in love with the wondrous machines he found there. He dedicated himself to the development of flying contraptions, leading an aerial defense force of seasoned veterans known as the Screaming Yipsnakes. Calm under fire, Corki patrols the skies around his adopted home, and has never encountered a problem that a good missile barrage couldn’t solve.\n",
      "type": "Mixed"
    }
  },
  {
    "Darius": {
      "display_name": "Darius",
      "title": "The Hand of Noxus",
      "lore_snippet": "There is no greater symbol of Noxian might than Darius, the nation’s most feared and battle-hardened leader. Rising from humble origins to become the Hand of Noxus, he cleaves through the empire’s enemies—many of them Noxians themselves. Knowing that he never doubts his cause is just, and never hesitates once his axe is raised, those who stand against the commander of the Trifarian Legion can expect no mercy.\n",
      "type": "Physical"
    }
  },
  {
    "Diana": {
      "display_name": "Diana",
      "title": ", Scorn of the Moon",
      "lore_snippet": "Bearing her crescent moonblade, Diana fights as a warrior of the Lunari—a faith all but quashed in the lands around Mount Targon. Clad in shimmering armor the color of winter snow at night, she is a living embodiment of the silver moon’s power. Imbued with the essence of an Aspect from beyond Targon’s towering summit, Diana is no longer wholly human, and struggles to understand her power and purpose in this world.\n",
      "type": "Magic"
    }
  },
  {
    "Dr. Mundo": {
      "display_name": "Dr. Mundo",
      "title": ", The Madman of Zaun",
      "lore_snippet": "Utterly insane, unrepentantly homicidal, and horrifyingly purple, Dr. Mundo is what keeps many of Zaun’s citizens indoors on particularly dark nights. This monosyllabic monstrosity seems to want nothing more than pain—both the giving of it, and the receiving of it. Wielding his massive meat cleaver as if it were weightless, Mundo is infamous for capturing and torturing dozens of Zaun’s citizens for his nefarious “operations,” which seem to have no overall point or goal. He is brutal. He is unpredictable. He goes where he pleases. He is also not, technically, a doctor.\n",
      "type": "Mixed"
    }
  },
  {
    "Draven": {
      "display_name": "Draven",
      "title": ", The Glorious Executioner",
      "lore_snippet": "In Noxus, warriors known as reckoners face one another in arenas where blood is spilled and strength tested—but none has ever been as celebrated as Draven. A former soldier, he found that the crowds uniquely appreciated his flair for the dramatic, not to mention the spray of blood from each of his spinning axes. Addicted to the spectacle of his own brash perfection, Draven has sworn to defeat whomever he must to ensure that his name is chanted throughout the empire forever more.\n",
      "type": "Physical"
    }
  },
  {
    "Ekko": {
      "display_name": "Ekko",
      "title": ", The Glorious Executioner",
      "lore_snippet": "A prodigy from the rough streets of Zaun, Ekko manipulates time to twist any situation to his advantage. Using his own invention, the Z-Drive, he explores the branching possibilities of reality to craft the perfect moment. Though he revels in this freedom, when there’s a threat to his friends, he’ll do anything to defend them. To outsiders, Ekko seems to achieve the impossible the first time, every time.",
      "type": "Magic"
    }
  },
  {
    "Elise": {
      "display_name": "Elise",
      "title": ", The Spider Queen",
      "lore_snippet": "Elise is a deadly predator who dwells in a shuttered, lightless palace, deep within the oldest city of Noxus. Once mortal, she was the mistress of a powerful house, but the bite of a vile demigod transformed her into something beautiful, yet utterly inhuman—a spider-like creature, drawing unsuspecting prey into her web. To maintain her eternal youth, Elise now prefers to feed upon the naive and the faithless, and there are few who can resist her seductions.\n",
      "type": "Magic"
    }
  },
  {
    "Evelynn": {
      "display_name": "Evelynn",
      "title": ", Agony's Embrace",
      "lore_snippet": "Within the dark seams of Runeterra, the demon Evelynn searches for her next victim. She lures in prey with the voluptuous façade of a human female, but once a person succumbs to her charms, Evelynn’s true form is unleashed. She then subjects her victim to unspeakable torment, gratifying herself with their pain. To the demon, these liaisons are innocent flings. To the rest of Runeterra, they are ghoulish tales of lust gone awry and horrific reminders of the cost of wanton desire.\n",
      "type": "Magic"
    }
  },
  {
    "Ezreal": {
      "display_name": "Ezreal",
      "title": ", The Prodigal Explorer",
      "lore_snippet": "Adashing adventurer, unknowingly gifted in the magical arts, Ezreal raids long-lost catacombs, tangles with ancient curses, and overcomes seemingly impossible odds with ease. His courage and bravado knowing no bounds, he prefers to improvise his way out of any situation, relying partially on his wits, but mostly on his mystical Shuriman gauntlet, which he uses to unleash devastating arcane blasts. One thing is for sure—whenever Ezreal is around, trouble isn’t too far behind. Or ahead. Probably everywhere.\n\n",
      "type": "Magic"
    }
  },
  {
    "Fiddlesticks": {
      "display_name": "Fiddlesticks",
      "title": ", The Harbinger of Doom",
      "lore_snippet": "Fiddlesticks is a ghastly, living scarecrow who stalks the darkness, wielding a cruel scythe and preying upon the unwary. Once a lonely man accused of bringing famine to his village, he was tied up and left to starve in his own barren field. Resurrected by the savage murder of crows that fed on his remains, Fiddlesticks now relishes terrorizing his victims before claiming their lives amid a flurry of feathers and blood-splattered beaks.\n",
      "type": "Magic"
    }
  },
  {
    "Fiora": {
      "display_name": "Fiora",
      "title": ", The Grand Duelist",
      "lore_snippet": "The most feared duelist in all Valoran, Fiora is as renowned for her brusque manner and cunning mind as she is for the speed of her bluesteel rapier. Born to House Laurent in the kingdom of Demacia, Fiora took control of the family from her father in the wake of a scandal that nearly destroyed them. House Laurent's reputation was sundered, but Fiora bends her every effort to restore her family's honor and return them to their rightful place among the great and good of Demacia.\n",
      "type": "Physical"
    }
  },
  {
    "Fizz": {
      "display_name": "Fizz",
      "title": ", The Tidal Trickster",
      "lore_snippet": "Fizz is an amphibious yordle, who dwells among the reefs surrounding Bilgewater. He often retrieves and returns the tithes cast into the sea by superstitious captains, but even the saltiest of sailors know better than to cross him—for many are the tales of those who have underestimated this slippery character. Often mistaken for some manner of capricious ocean spirit, he seems able to command the beasts of the deep, and delights in confounding his allies and enemies alike.\n",
      "type": "Magic"
    }
  },
  {
    "Galio": {
      "display_name": "Galio",
      "title": ", The Colossus",
      "lore_snippet": "Outside the Great City of Demacia, the stone colossus Galio keeps vigilant watch. Built as a bulwark against enemy mages, he often stands motionless for decades until the presence of powerful magic stirs him to life. Once activated, Galio makes the most of his time, savoring the thrill of a fight and the rare honor of defending his countrymen. But his triumphs are always bittersweet, for the magic he destroys is also his source of reanimation, and each victory leaves him dormant once again.\n",
      "type": "Magic"
    }
  },
  {
    "Gangplank": {
      "display_name": "Gangplank",
      "title": ", The Saltwater Scourge",
      "lore_snippet": "As unpredictable as he is brutal, the dethroned reaver king Gangplank is feared far and wide. Once, he ruled the port city of Bilgewater, and while his reign is over, there are those who believe this has only made him more dangerous. Gangplank would see Bilgewater bathed in blood once more before letting someone else take it—and now with pistol, cutlass, and barrels of gunpowder, he is determined to reclaim what he has lost.\n",
      "type": "Physical"
    }
  },
  {
    "Garen": {
      "display_name": "Garen",
      "title": "The Might of Demacia",
      "lore_snippet": "Aproud and noble soldier, Garen fights at the head of the Dauntless Vanguard. He is popular among his fellows, and respected well enough by his enemies—not least as a scion of the prestigious Crownguard family, entrusted with defending Demacia and its ideals. Clad in magic-resistant armor and bearing a mighty broadsword, Garen stands ready to confront mages and sorcerers on the field of battle, in a veritable whirlwind of righteous steel.\n",
      "type": "Physical"
    }
  },
  {
    "Gnar": {
      "display_name": "Gnar",
      "title": ", The Missing Link",
      "lore_snippet": "Gnar is an excitable yordle whose playful antics can erupt into a toddler’s outrage in an instant, transforming him into a massive beast bent on destruction. Frozen in True Ice for millennia, the curious creature broke free and now hops about a changed world he sees as exotic and wondrous. Delighted by danger, Gnar flings whatever he can at his enemies, be it his bonetooth boomerang... or an uprooted tree.\n\n",
      "type": "Physical"
    }
  },
  {
    "Gragas": {
      "display_name": "Gragas",
      "title": ", The Rabble Rouser",
      "lore_snippet": "Equal parts jolly and imposing, Gragas is a massive, rowdy brewmaster on his own quest for the perfect pint of ale. Hailing from parts unknown, he now searches for rare ingredients among the unblemished wastes of the Freljord, trying each recipe as he goes. Often intoxicated and extremely impulsive, he is legendary for the brawls he starts, which often end in all-night parties and widespread property damage. Any appearance from Gragas must surely foreshadow drinking and destruction—in that order.\n",
      "type": "Magic"
    }
  },
  {
    "Graves": {
      "display_name": "Graves",
      "title": ", The Outlaw",
      "lore_snippet": "Malcolm Graves is a renowned mercenary, gambler, and thief—a wanted man in every city and empire he has visited. Even though he has an explosive temper, he possesses a strict sense of criminal honor, often enforced at the business end of his double-barreled shotgun Destiny. In recent years, he has reconciled a troubled partnership with Twisted Fate, and together they have prospered once more in the turmoil of Bilgewater’s criminal underbelly.\n",
      "type": "Physical"
    }
  },
  {
    "Hecarim": {
      "display_name": "Hecarim",
      "title": ", The Shadow of War",
      "lore_snippet": "Hecarim is a spectral fusion of man and beast, cursed to ride down the souls of the living for all eternity. When the Blessed Isles fell into shadow, this proud knight was undone by the destructive energies of the Ruination, along with all his cavalry and their mounts. Now, whenever the Black Mist reaches out across Runeterra, he leads their devastating charge, reveling in the slaughter and crushing foes beneath his armored hooves.\n",
      "type": "Physical"
    }
  },
  {
    "Heimerdinger": {
      "display_name": "Heimerdinger",
      "title": ", The Revered Inventor",
      "lore_snippet": "Abrilliant yet eccentric yordle scientist, Professor Cecil B. Heimerdinger is one of the most innovative and esteemed inventors Piltover has ever known. Relentless in his work to the point of neurotic obsession, he thrives on answering the universe’s most impenetrable questions. Though his theories often appear opaque and esoteric, Heimerdinger has crafted some of Piltover’s most miraculous—not to mention lethal—machinery, and constantly tinkers with his inventions to make them even more efficient.\n",
      "type": "Magic"
    }
  },
  {
    "Illaoi": {
      "display_name": "Illaoi",
      "title": ", The Kraken Priestess",
      "lore_snippet": "Illaoi’s powerful physique is dwarfed only by her indomitable faith. As the prophet of the Great Kraken, she uses a huge, golden idol to rip her foes’ spirits from their bodies and shatter their perception of reality. All who challenge the “Truth Bearer of Nagakabouros” soon discover Illaoi never battles alone—the god of the Serpent Isles fights by her side.\n",
      "type": "Physical"
    }
  },
  {
    "Irelia": {
      "display_name": "Irelia",
      "title": ", The Blade Dancer",
      "lore_snippet": "The Noxian occupation of Ionia produced many heroes, none more unlikely than young Irelia of Navori. Trained in the ancient dances of her province, she adapted her art for war, using the graceful and carefully practised movements to levitate a host of deadly blades. After proving herself as a fighter, she was thrust into the role of resistance leader and figurehead, and to this day remains dedicated to the preservation of her homeland.\n",
      "type": "Mixed"
    }
  },
  {
    "Ivern": {
      "display_name": "Ivern",
      "title": ", The Green Father",
      "lore_snippet": "Ivern Bramblefoot, known to many as the Green Father, is a peculiar half man, half tree who roams Runeterra’s forests, cultivating life everywhere he goes. He knows the secrets of the natural world, and holds deep friendships with all things that grow, fly, and scuttle. Ivern wanders the wilderness, imparting strange wisdom to any he meets, enriching the forests, and occasionally entrusting loose-lipped butterflies with his secrets.\n",
      "type": "Magic"
    }
  },
  {
    "Janna": {
      "display_name": "Janna",
      "title": ", The Storm's Fury",
      "lore_snippet": "An ancient and mysterious wind spirit, Janna has come to protect the dispossessed of Zaun. While her presence is most often felt as a soothing breeze or a ferocious tempest, she also can manifest in corporeal form as an ethereal figure, comforting the downtrodden. Over the eons, Janna has witnessed the rise and fall of civilizations. Through it all, she remains steadfast as a beacon of hope to those in need.\n",
      "type": "Magic"
    }
  },
  {
    "Jarvan IV": {
      "display_name": "Jarvan IV",
      "title": ", The Exemplar of Demacia",
      "lore_snippet": "As the king’s only son, Prince Jarvan is heir apparent to the throne of Demacia. Raised to be a paragon of his nation’s greatest virtues, he is forced to balance the heavy expectations placed upon him with his own desire to prove himself on the battlefield. An exceptional warrior in his own right, Jarvan also inspires his troops with fearsome courage and selfless determination, raising his family’s colors high and revealing his true strength as a future leader of his people.\n",
      "type": "Physical"
    }
  },
  {
    "Jax": {
      "display_name": "Jax",
      "title": ", Grandmaster at Arms",
      "lore_snippet": "Unmatched in both his skill with unique armaments and his biting sarcasm, Jax is the last known weapons master of Icathia. After his homeland was laid low by its own hubris in unleashing the Void, Jax and his kind vowed to protect what little remained. As magic now rises in the world, this slumbering threat stirs once more, and Jax roams Valoran, wielding the last light of Icathia and testing all warriors he meets to see if any are strong enough to stand beside him...\n",
      "type": "Mixed"
    }
  },
  {
    "Jayce": {
      "display_name": "Jayce",
      "title": ", The Defender of Tomorrow",
      "lore_snippet": "Jayce is a brilliant inventor who has pledged his life to the defense of Piltover and its unyielding pursuit of progress. With his transforming hextech hammer in hand, Jayce uses his strength, courage, and considerable intelligence to protect his hometown. While revered throughout the city as a hero, he hasn’t taken well to the attention heroism brings. Still, Jayce’s heart is in the right place, and even those who envy his natural skills are grateful for his protection in the City of Progress.\n",
      "type": "Physical"
    }
  },
  {
    "Jhin": {
      "display_name": "Jhin",
      "title": ", The Virtuoso",
      "lore_snippet": "Jhin is a meticulous criminal psychopath who believes murder is art. Once an Ionian prisoner, but freed by shadowy elements within Ionia’s ruling council, the serial killer now works as their cabal's assassin. Using his gun as his paintbrush, Jhin creates works of artistic brutality, horrifying victims and onlookers. He gains a cruel pleasure from putting on his gruesome theater, making him the ideal choice to send the most powerful of messages: terror.\n",
      "type": "Physical"
    }
  },
  {
    "Jinx": {
      "display_name": "Jinx",
      "title": ", The Loose Cannon",
      "lore_snippet": "Amanic and impulsive criminal from Zaun, Jinx lives to wreak havoc without care for the consequences. With an arsenal of deadly weapons, she unleashes the loudest blasts and brightest explosions to leave a trail of mayhem and panic in her wake. Jinx despises boredom, and gleefully brings her own chaotic brand of pandemonium wherever she goes.\n",
      "type": "Physical"
    }
  },
  {
    "Kai'Sa": {
      "display_name": "Kai'Sa",
      "title": ", Daughter of the Void",
      "lore_snippet": "Claimed by the Void when she was only a child, Kai’Sa managed to survive through sheer tenacity and strength of will. Her experiences have made her a deadly hunter and, to some, the harbinger of a future they would rather not live to see. Having entered into an uneasy symbiosis with a living Void carapace, the time will soon come when she must decide whether to forgive those mortals who would call her a monster, and defeat the coming darkness together… or simply to forget, as the Void consumes the world that left her behind.\n",
      "type": "Mixed"
    }
  },
  {
    "Kalista": {
      "display_name": "Kalista",
      "title": ", The Spear of Vengeance",
      "lore_snippet": "An undying specter of wrath and retribution, Kalista is an armored nightmare summoned from the Shadow Isles to hunt deceivers and traitors. The betrayed may cry out in blood to be avenged, but Kalista only answers those willing to pay with their very souls. Those who become the focus of Kalista’s wrath should make their final peace, for any pact sealed with this grim hunter can only be ended by the cold, piercing fire of her soul-spears.\n",
      "type": "Physical"
    }
  },
  {
    "Karma": {
      "display_name": "Karma",
      "title": ", The Enlightened One",
      "lore_snippet": "No mortal exemplifies the spiritual traditions of Ionia more than Karma. She is the living embodiment of an ancient soul reincarnated countless times, carrying all her accumulated memories into each new life, and blessed with power that few can comprehend. She has done her best to guide her people in recent times of crisis, though she knows that peace and harmony may come only at a considerable cost—both to her, and to the land she holds most dear.\n\n",
      "type": "Magic"
    }
  },
  {
    "Karthus": {
      "display_name": "Karthus",
      "title": ", The Deathsinger",
      "lore_snippet": "The harbinger of oblivion, Karthus is an undying spirit whose haunting songs are a prelude to the horror of his nightmarish appearance. The living fear the eternity of undeath, but Karthus sees only beauty and purity in its embrace, a perfect union of life and death. When Karthus emerges from the Shadow Isles, it is to bring the joy of death to mortals, an apostle of the unliving.\n",
      "type": "Magic"
    }
  },
  {
    "Kassadin": {
      "display_name": "Kassadin",
      "title": ", The Void Walker",
      "lore_snippet": "Cutting a burning swath through the darkest places of the world, Kassadin knows his days are numbered. A widely traveled Shuriman guide and adventurer, he had chosen to raise a family among the peaceful southern tribes—until the day his village was consumed by the Void. He vowed vengeance, combining a number of arcane artifacts and forbidden technologies for the struggle ahead. Finally, Kassadin set out for the wastelands of Icathia, ready to face any monstrous Void-construct in his search for their self-proclaimed prophet, Malzahar.\n",
      "type": "Magic"
    }
  },
  {
    "Katarina": {
      "display_name": "Katarina",
      "title": ", The Sinister Blade",
      "lore_snippet": "Decisive in judgment and lethal in combat, Katarina is a Noxian assassin of the highest caliber. Eldest daughter to the legendary General Du Couteau, she made her talents known with swift kills against unsuspecting enemies. Her fiery ambition has driven her to pursue heavily-guarded targets, even at the risk of endangering her allies—but no matter the mission, Katarina will not hesitate to execute her duty amid a whirlwind of serrated daggers.\n",
      "type": "Magic"
    }
  },
  {
    "Kayle": {
      "display_name": "Kayle",
      "title": ", The Righteous",
      "lore_snippet": "Born to a Targonian Aspect at the height of the Rune Wars, Kayle honored her mother’s legacy by fighting for justice on wings of divine flame. She and her twin sister Morgana were the protectors of Demacia for many years—until Kayle became disillusioned with the repeated failings of mortals, and abandoned this realm altogether. Still, legends are told of her punishing the unjust with her fiery swords, and many hope that she will one day return…\n",
      "type": "Mixed"
    }
  },
  {
    "Kayn": {
      "display_name": "Kayn",
      "title": ", The Shadow Reaper",
      "lore_snippet": "Apeerless practitioner of lethal shadow magic, Shieda Kayn battles to achieve his true destiny—to one day lead the Order of Shadow into a new era of Ionian supremacy. He wields the sentient darkin weapon Rhaast, undeterred by its creeping corruption of his body and mind. There are only two possible outcomes: either Kayn bends the weapon to his will... or the malevolent blade consumes him completely, paving the way for the destruction of all Runeterra.\n\n",
      "type": "Physical"
    }
  },
  {
    "Kennen": {
      "display_name": "Kennen",
      "title": ", The Heart of the Tempest",
      "lore_snippet": "More than just the lightning-quick enforcer of Ionian balance, Kennen is the only yordle member of the Kinkou. Despite his small, furry stature, he is eager to take on any threat with a whirling storm of shuriken and boundless enthusiasm. Alongside his master Shen, Kennen patrols the spirit realm, employing devastating electrical energy to strike down his enemies.\n",
      "type": "Magic"
    }
  },
  {
    "Kha'Zix": {
      "display_name": "Kha'Zix",
      "title": "The Voidreaver",
      "lore_snippet": "The Void grows, and the Void adapts—in none of its myriad spawn are these truths more apparent than Kha’Zix. Evolution drives the core of this mutating horror, born to survive and to slay the strong. Where it struggles to do so, it grows new, more effective ways to counter and kill its prey. Initially a mindless beast, Kha’Zix’s intelligence has developed as much as its form. Now, the creature plans out its hunts, and even utilizes the visceral terror it engenders in its victims.\n",
      "type": "Physical"
    }
  },
  {
    "Kindred": {
      "display_name": "Kindred",
      "title": ", The Eternal Huntres",
      "lore_snippet": "Separate, but never parted, Kindred represents the twin essences of death. Lamb’s bow offers a swift release from the mortal realm for those who accept their fate. Wolf hunts down those who run from their end, delivering violent finality within his crushing jaws. Though interpretations of Kindred’s nature vary across Runeterra, every mortal must choose the true face of their death.\n",
      "type": "Physical"
    }
  },
  {
    "Kled": {
      "display_name": "Kd",
      "title": ", The Cantankerous Cavalier",
      "lore_snippet": "Awarrior as fearless as he is ornery, the yordle Kled embodies the furious bravado of Noxus. He is an icon beloved by the empire’s soldiers, distrusted by its officers, and loathed by the nobility. Many claim Kled has fought in every campaign the legions have waged, has “acquired” every military title, and has never once backed down from a fight. Though the truth of the matter is often questionable, one part of his legend is undeniable: Charging into battle on his un-trusty steed, Skaarl, Kled fights to protect what’s his… and to take whatever he can get.\n",
      "type": "Physical"
    }
  },
  {
    "Kog'Maw": {
      "display_name": "Kog'Maw",
      "title": ", The Mouth of the Abyss",
      "lore_snippet": "Belched forth from a rotting Void incursion deep in the wastelands of Icathia, Kog’Maw is an inquisitive yet putrid creature with a caustic, gaping mouth. This particular Void-spawn needs to gnaw and drool on anything within reach to truly understand it. Though not inherently evil, Kog’Maw’s beguiling naiveté is dangerous, as it often precedes a feeding frenzy—not for sustenance, but to satisfy its unending curiosity.\n",
      "type": "Mixed"
    }
  },
  {
    "LeBlanc": {
      "display_name": "LeBlanc",
      "title": ", The Deceiver",
      "lore_snippet": "Mysterious even to other members of the Black Rose cabal, LeBlanc is but one of many names for a pale woman who has manipulated people and events since the earliest days of Noxus. Using her magic to mirror herself, the sorceress can appear to anyone, anywhere, and even be in many places at once. Always plotting just out of sight, LeBlanc’s true motives are as inscrutable as her shifting identity.\n",
      "type": "Magic"
    }
  },
  {
    "Lee Sin": {
      "display_name": "Lee Sin",
      "title": ", The Blind Monk",
      "lore_snippet": "Amaster of Ionia’s ancient martial arts, Lee Sin is a principled fighter who channels the essence of the dragon spirit to face any challenge. Though he lost his sight many years ago, the warrior-monk has devoted his life to protecting his homeland against any who would dare upset its sacred balance. Enemies who underestimate his meditative demeanor will endure his fabled burning fists and blazing roundhouse kicks.\n",
      "type": "Physical"
    }
  },
  {
    "Leona": {
      "display_name": "Leona",
      "title": ", The Radiant Dawn",
      "lore_snippet": "Imbued with the fire of the sun, Leona is a holy warrior of the Solari who defends Mount Targon with her Zenith Blade and the Shield of Daybreak. Her skin shimmers with starfire while her eyes burn with the power of the celestial Aspect within her. Armored in gold and bearing a terrible burden of ancient knowledge, Leona brings enlightenment to some, death to others.\n",
      "type": "Magic"
    }
  },
  {
    "Lissandra": {
      "display_name": "Lissandra",
      "title": ", The Ice Witch",
      "lore_snippet": "As the reclusive leader of the Frostguard, many believe Lissandra is a living saint whose followers bring healing and wisdom to the tribes of the Freljord. The truth is perhaps more sinister, as she uses her elemental magic to twist the power of True Ice into something dark and terrible, entombing or impaling any who would reveal her deepest secrets. Indeed, the legacy of her past may yet be the beginning of the end for Runeterra.\n\n",
      "type": "Magic"
    }
  },
  {
    "Lucian": {
      "display_name": "Lucian",
      "title": ", The Purifier",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Lulu": {
      "display_name": "Lulu",
      "title": ", The Fae Sorceress",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Lux": {
      "display_name": "Lux",
      "title": ", The Lady of Luminosity",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Malphite": {
      "display_name": "Malphite",
      "title": ", Shard of the Monoith",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Malzahar": {
      "display_name": "Malzahar",
      "title": ", The Prophet of the Void",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Maokai": {
      "display_name": "Maokai",
      "title": ", The Twisted Treant",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Master Yi": {
      "display_name": "Master Yi",
      "title": ", The Wuju Bladesman",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Miss Fortune": {
      "display_name": "Miss Fortune",
      "title": ", The Bounty Hunter",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Mordekaiser": {
      "display_name": "Mordekaiser",
      "title": ", The Iron Revenant",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Morgana": {
      "display_name": "Morgana",
      "title": ", The Fallen",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Nami": {
      "display_name": "Nami",
      "title": ", The Tidecaller",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Nasus": {
      "display_name": "Nasus",
      "title": ", The Curator of the Sands",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Nautilus": {
      "display_name": "Nautilus",
      "title": ", The Titan of the Depths",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Neeko": {
      "display_name": "Neeko",
      "title": ", The Curious Chameleon",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Nidalee": {
      "display_name": "Nidalee",
      "title": ", The Bestial Huntress",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Nocturne": {
      "display_name": "Nocturne",
      "title": ", The Eternal Nightmare",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Numu & Willump": {
      "display_name": "Nunu & Willump",
      "title": ", The Boy and his Yeti",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Olaf": {
      "display_name": "Olaf",
      "title": ", The Beserker",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Orianna": {
      "display_name": "Orianna",
      "title": ", The Lady of the Clockwork",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Ornn": {
      "display_name": "Ornn",
      "title": ", The Fire Below the Mountain",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Pantheon": {
      "display_name": "Pantheon",
      "title": ", The Unbreakable Spear",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Poppy": {
      "display_name": "Poppy",
      "title": ", Keeper of the Hammer",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Pyke": {
      "display_name": "Pyke",
      "title": ", The Bloodharbor Ripper",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Qiyana": {
      "display_name": "Qiyana",
      "title": ", Empress of the Elements",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Quinn": {
      "display_name": "Quinn",
      "title": ", Demacia's Wings",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Rakan": {
      "display_name": "Rakan",
      "title": ", The Charmer",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Rammus": {
      "display_name": "Rammus",
      "title": ", The Armordillo",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Rek'Sai": {
      "display_name": "Rek'Sai",
      "title": ", The Vod Burrower",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Renekton": {
      "display_name": "Renekton",
      "title": ", The Butcher of the Sands",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Rengar": {
      "display_name": "Rengar",
      "title": ", The Pridestalker",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Riven": {
      "display_name": "Riven",
      "title": ", The Exile",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Rumble": {
      "display_name": "Rumble",
      "title": ", The Mechanized Menace",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Ryze": {
      "display_name": "Ryze",
      "title": ", The Rune Mage",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Sejuani": {
      "display_name": "Sejuani",
      "title": ", Fury of the North",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Senna": {
      "display_name": "Senna",
      "title": ", The Redeemer",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Shaco": {
      "display_name": "Shaco",
      "title": ", The Demon Jester",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Shen": {
      "display_name": "Shen",
      "title": ", The Eye of Twilight",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Shyvana": {
      "display_name": "Shyvana",
      "title": ", The Half-Dragon",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Singed": {
      "display_name": "Singed",
      "title": ", The Mad Chemist",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Sion": {
      "display_name": "Sion",
      "title": ", The Undead Juggernaut",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Sivir": {
      "display_name": "Sivir",
      "title": ", The Battle Mistress",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Skarner": {
      "display_name": "Skarner",
      "title": ", The Crystal Vanguard",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Sona": {
      "display_name": "Sona",
      "title": ", The Maven of the Strings",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Soraka": {
      "display_name": "Soraka",
      "title": ", The Starchild",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Swain": {
      "display_name": "Swain",
      "title": ", The Noxian Grand General",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Sylas": {
      "display_name": "Sylas",
      "title": ", The Unshackled",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Syndra": {
      "display_name": "Syndra",
      "title": ", The Dark Sovereign",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Tahm Kench": {
      "display_name": "Tahm Kench",
      "title": ", The River King",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Taliyah": {
      "display_name": "Taliyah",
      "title": ", The Stoneweaver",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Talon": {
      "display_name": "Talon",
      "title": ", The Blades Shadow",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Taric": {
      "display_name": "Taric",
      "title": ", The Shield of Valoran",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Teemo": {
      "display_name": "Teemo",
      "title": ", The Swift Scout",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Thresh": {
      "display_name": "Thresh",
      "title": ", The Chain Warden",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Tristana": {
      "display_name": "Tristana",
      "title": ", The Yordle Gunner",
      "lore_snippet": "While many other yordles channel their energy into discovery, invention, or just plain mischief-making, Tristana was always inspired by the adventures of great warriors. She had heard much about Runeterra, its factions, and its wars, and believed her kind could become worthy of legend too. Setting foot in the world for the first time, she took up her trusty cannon Boomer, and now leaps into battle with steadfast courage and optimism.\n",
      "type": "Physical"
    }
  },
  {
    "Trundle": {
      "display_name": "Trundle",
      "title": ", The Troll King",
      "lore_snippet": "Trundle is a hulking and devious troll with a particularly vicious streak, and there is nothing he cannot bludgeon into submission—not even the Freljord itself. Fiercely territorial, he chases down anyone foolish enough to enter his domain. Then, his massive club of True Ice at the ready, he chills his enemies to the bone and impales them with jagged, frozen pillars, laughing as they bleed out onto the tundra.\n",
      "type": "Physical"
    }
  },
  {
    "Tryndamere": {
      "display_name": "Tryndamere",
      "title": ", The Barbarian King",
      "lore_snippet": "Fueled by unbridled fury and rage, Tryndamere once carved his way through the Freljord, openly challenging the greatest warriors of the north to prepare himself for even darker days ahead. The wrathful barbarian has long sought revenge for the annihilation of his clan, but more recently he has found companionship with Ashe, forging an alliance of marriage with the Avarosan warmother. His almost inhuman strength and fortitude are legendary, and have delivered him and his new allies countless victories against the greatest of odds.\n\n",
      "type": "Physical"
    }
  },
  {
    "Twisted Fate": {
      "display_name": "Twisted Fate",
      "title": ", The Card Master",
      "lore_snippet": "Twisted Fate is an infamous cardsharp and swindler who has gambled and charmed his way across much of the known world, earning the enmity and admiration of the rich and foolish alike. He rarely takes things seriously, greeting each day with a mocking smile and an insouciant swagger. In every possible way, Twisted Fate always has an ace up his sleeve.\n",
      "type": "Magic"
    }
  },
  {
    "Twitch": {
      "display_name": "Twitch",
      "title": ", The Plague Rat",
      "lore_snippet": "AZaunite plague rat by birth, but a connoisseur of filth by passion, Twitch is not afraid to get his paws dirty. Aiming a chem-powered crossbow at the gilded heart of Piltover, he has vowed to show those in the city above just how filthy they really are. Always a sneaky sneak, when he’s not rooting around in the Sump, he’s digging deep into other people’s garbage for discarded treasures… and perhaps a moldy sandwich.\n",
      "type": "Physical"
    }
  },
  {
    "Udyr": {
      "display_name": "Udyr",
      "title": ", The Spirit Walker",
      "lore_snippet": "",
      "type": ""
    }
  },
  {
    "Urgot": {
      "display_name": "Urgot",
      "title": ", The Dreadnought",
      "lore_snippet": "Once a powerful Noxian headsman, Urgot was betrayed by the empire for which he had killed so many. Bound in iron chains, he was forced to learn the true meaning of strength in the Dredge—a prison mine deep beneath Zaun. Emerging in a disaster that spread chaos throughout the city, he now casts an imposing shadow over its criminal underworld. Raising his victims on the very chains that once enslaved him, he will purge his new home of the unworthy, making it a crucible of pain.\n",
      "type": "Physical"
    }
  },
  {
    "Varus": {
      "display_name": "Varus",
      "title": ", The Arrow of Retribution",
      "lore_snippet": "One of the ancient darkin, Varus was a deadly killer who loved to torment his foes, driving them almost to insanity before delivering the killing arrow. He was imprisoned at the end of the Great Darkin War, but escaped centuries later in the remade flesh of two Ionian hunters—they had unwittingly released him, cursed to bear the bow containing his bound essence. Varus now seeks out those who trapped him, in order to enact his brutal vengeance, but the mortal souls within still resist him every step of the way.\n\n",
      "type": "Physical"
    }
  },
  {
    "Vayne": {
      "display_name": "Vayne",
      "title": ", The Night Hunter",
      "lore_snippet": "Shauna Vayne is a deadly, remorseless Demacian monster hunter, who has dedicated her life to finding and destroying the demon that murdered her family. Armed with a wrist-mounted crossbow and a heart full of vengeance, she is only truly happy when slaying practitioners or creations of the dark arts, striking from the shadows with a flurry of silver bolts.\n",
      "type": "Physical"
    }
  },
  {
    "Veigar": {
      "display_name": "Veigar",
      "title": ", The Tiny Master of Evil",
      "lore_snippet": "An enthusiastic yordle sorcerer, Veigar has embraced powers that few others dare even approach. As a free-spirited inhabitant of Bandle City, he once longed to learn more of the celestial magic practiced by mortals, but his natural curiosity was twisted by imprisonment in the Immortal Bastion. Now a stubborn creature with the dark fury of the stars at his command, Veigar is often underestimated by others—and though he believes himself truly evil, there are some who still question his deeper motivations…\n\n",
      "type": "Magic"
    }
  },
  {
    "Vel'Koz": {
      "display_name": "Vel'Koz",
      "title": ", The Eye of the Void",
      "lore_snippet": "It is unclear if Vel’Koz was the first Voidborn to emerge on Runeterra, but there has certainly never been another to match his level of cruel, calculating sentience. While his kin devour or defile everything around them, he seeks instead to scrutinize and study the physical realm—and the strange, warlike beings that dwell there—for any weakness the Void might exploit. But Vel’Koz is far from a passive observer, striking back at threats with deadly plasma, or by disrupting the very fabric of the world itself.\n\n",
      "type": "Magic"
    }
  },
  {
    "Vi": {
      "display_name": "Vi",
      "title": ", The Piltover Enforcer",
      "lore_snippet": "Once a criminal from the mean streets of Zaun, Vi is a hotheaded, impulsive, and fearsome woman with only a very loose respect for authority figures. Growing up all but alone, Vi developed finely honed survival instincts as well as a wickedly abrasive sense of humor. Now working with the Wardens to keep the peace in Piltover, she wields mighty hextech gauntlets that can punch through walls—and suspects—with equal ease.\n",
      "type": "Physical"
    }
  },
  {
    "Viktor": {
      "display_name": "Viktor",
      "title": ", The Machine Herald",
      "lore_snippet": "The herald of a new age of technology, Viktor has devoted his life to the advancement of humankind. An idealist who seeks to lift the people of Zaun to a new level of understanding, he believes that only by embracing a glorious evolution of technology can humanity’s full potential be realized. With a body augmented by steel and science, Viktor is zealous in his pursuit of this bright future.\n",
      "type": "Magic"
    }
  },
  {
    "Vladimir": {
      "display_name": "Vladimir",
      "title": ", The Crimson Reaper",
      "lore_snippet": "Afiend with a thirst for mortal blood, Vladimir has influenced the affairs of Noxus since the empire’s earliest days. In addition to unnaturally extending his life, his mastery of hemomancy allows him to control the minds and bodies of others as easily as his own. In the flamboyant salons of the Noxian aristocracy, this enabled him to build a fanatical cult of personality around himself—while in the lowest back alleys, it allows him to bleed his enemies dry.\n\n",
      "type": "Magic"
    }
  },
  {
    "Volibear": {
      "display_name": "Volibear",
      "title": ", The Thunders Roar",
      "lore_snippet": "The thunderous demigod known as the Thousand-Pierced Bear is the battle-spirit of the Freljord. Thousands of years of constant and bitter wars, fought in the coldest winters, have hardened Volibear into a truly indomitable force, hurling bolts of lightning from the highest peaks—and when snowy tempests rage down, it can only mean that he is on the attack once more. Any who dare to face him may find themselves joining his fierce army of Ursine warriors… assuming they do not fall victim to his savage claws.\n",
      "type": "Physical"
    }
  },
  {
    "Warwick": {
      "display_name": "Warwick",
      "title": ", The Uncaged Wrath of Zaun",
      "lore_snippet": "Warwick is a monster who hunts the gray alleys of Zaun. Transformed by agonizing experiments, his body is fused with an intricate system of chambers and pumps, machinery filling his veins with alchemical rage. Bursting out of the shadows, he preys upon those criminals who terrorize the city’s depths. Warwick is drawn to blood, and driven mad by its scent. None who spill it can escape him.\n",
      "type": "Mixed"
    }
  },
  {
    "Wukong": {
      "display_name": "Wukong",
      "title": ", The Monkey King",
      "lore_snippet": "Wukong is a vastayan trickster who uses his strength, agility, and intelligence to confuse his opponents and gain the upper hand. After finding a lifelong friend in the warrior known as Master Yi, Wukong became the last student of the ancient martial art known as Wuju. Armed with an enchanted staff, Wukong seeks to prevent Ionia from falling to ruin.\n",
      "type": "Physical"
    }
  },
  {
    "Xayah": {
      "display_name": "Xayah",
      "title": ", The Rebel",
      "lore_snippet": "Deadly and precise, Xayah is a vastayan revolutionary waging a personal war to save her people. She uses her speed, guile, and razor-sharp feather blades to cut down anyone who stands in her way. Xayah fights alongside her partner and lover, Rakan, to protect their dwindling tribe, and restore their race to her vision of its former glory.\n",
      "type": "Physical"
    }
  },
  {
    "Xerath": {
      "display_name": "Xerath",
      "title": ", The Magus Ascendant",
      "lore_snippet": "Xerath is an Ascended Magus of ancient Shurima, a being of arcane energy writhing in the broken shards of a magical sarcophagus. For millennia, he was trapped beneath the desert sands, but the rise of Shurima freed him from his ancient prison. Driven insane with power, he now seeks to take what he believes is rightfully his and replace the upstart civilizations of the world with one fashioned in his image.\n",
      "type": "Magic"
    }
  },
  {
    "Xin Zhao": {
      "display_name": "Xin Zhao",
      "title": ", The Seneschal of Demacia",
      "lore_snippet": "Xin Zhao is a resolute warrior loyal to the royal family of Demacia. Once condemned to the fighting pits of Noxus, he survived countless gladiatorial bouts. It was not until he faced the forces of King Jarvan III in battle that he decided to relinquish his past life, in favor of serving what he saw as a more honorable cause. Armed with his favored three-talon spear, Xin Zhao now fights for his adopted kingdom, audaciously challenging any foe, no matter the odds.\n",
      "type": "Physical"
    }
  },
  {
    "Yasuo": {
      "display_name": "Yasuo",
      "title": ", The Unforgiven",
      "lore_snippet": "An Ionian of deep resolve, Yasuo is an agile swordsman who wields the air itself against his enemies. As a proud young man, he was falsely accused of murdering his master—unable to prove his innocence, he was forced to slay his own brother in self defense. Even after his master’s true killer was revealed, Yasuo still could not forgive himself for all he had done, and now wanders his homeland with only the wind to guide his blade.\n\n",
      "type": "Physical"
    }
  },
  {
    "Yorick": {
      "display_name": "Yorick",
      "title": ", The Shepherd of Souls",
      "lore_snippet": "The last survivor of a long-forgotten religious order, Yorick is both blessed and cursed with power over the dead. Trapped on the Shadow Isles, his only companions are the rotting corpses and shrieking spirits that he gathers to him. Yorick’s monstrous actions belie his noble purpose: to free his home from the curse of the Ruination.\n",
      "type": "Mixed"
    }
  },
  {
    "Yuumi": {
      "display_name": "Yuumi",
      "title": ", The Magical Cat",
      "lore_snippet": "Amagical cat from Bandle City, Yuumi was once the familiar of a yordle enchantress, Norra. When her master mysteriously disappeared, Yuumi became the Keeper of Norra’s sentient Book of Thresholds, traveling through portals in its pages to search for her. Yearning for affection, Yuumi seeks friendly companions to partner with on her journey, protecting them with luminous shields and fierce resolve. While Book strives to keep her on task, Yuumi is often drawn to worldly comforts, such as naps and fish. In the end, however, she always returns to her quest to find her friend.\n",
      "type": "Magic"
    }
  },
  {
    "Zac": {
      "display_name": "Zac",
      "title": ", The Secret Weapon",
      "lore_snippet": "Zac is the product of a toxic spill that ran through a chemtech seam and pooled in an isolated cavern deep in Zaun’s Sump. Despite such humble origins, Zac has grown from primordial ooze into a thinking being who dwells in the city’s pipes, occasionally emerging to help those who cannot help themselves or to rebuild the broken infrastructure of Zaun.\n",
      "type": "Magic"
    }
  },
  {
    "Zed": {
      "display_name": "Zed",
      "title": ", The Master of Shadows",
      "lore_snippet": "Utterly ruthless and without mercy, Zed is the leader of the Order of Shadow, an organization he created with the intent of militarizing Ionia’s magical and martial traditions to drive out Noxian invaders. During the war, desperation led him to unlock the secret shadow form—a malevolent spirit magic as dangerous and corrupting as it is powerful. Zed has mastered all of these forbidden techniques to destroy anything he sees as a threat to his nation, or his new order.\n\n",
      "type": "Physical"
    }
  },
  {
    "Ziggs": {
      "display_name": "Ziggs",
      "title": ", The Hexplosives Expert",
      "lore_snippet": "With a love of big bombs and short fuses, the yordle Ziggs is an explosive force of nature. As an inventor’s assistant in Piltover, he was bored by his predictable life and befriended a mad, blue-haired bomber named Jinx. After a wild night on the town, Ziggs took her advice and moved to Zaun, where he now explores his fascinations more freely, terrorizing the chem-barons and regular citizens alike in his never ending quest to blow stuff up.\n",
      "type": "Magic"
    }
  },
  {
    "Zilean": {
      "display_name": "Zilean",
      "title": ", The Chronokeeper",
      "lore_snippet": "Once a member of Icathia’s governing council, Zilean is a prodigious elemental mage who seeks mastery over time itself. After using his powers in an attempt to save his people from the Void, he now drifts through the past, present, and future, bending and warping the flow of time around him. Zilean has traveled from Runeterra’s mysterious creation, all the way to its seemingly inevitable ending, searching tirelessly for any strand of fate that might undo his homeland’s destruction.\n",
      "type": "Magic"
    }
  },
  {
    "Zoe": {
      "display_name": "Zoe",
      "title": ", The Aspect of Twilight",
      "lore_snippet": "As the embodiment of mischief, imagination, and change, Zoe acts as the cosmic messenger of Targon, heralding major events that reshape worlds. Her mere presence warps the arcane mathematics governing realities, sometimes causing cataclysms without conscious effort or malice. This perhaps explains the breezy nonchalance with which Zoe approaches her duties, giving her plenty of time to focus on playing games, tricking mortals, or otherwise amusing herself. An encounter with Zoe can be joyous and life affirming, but it is always more than it appears and often extremely dangerous.\n",
      "type": "Magic"
    }
  },
  {
    "Zyra": {
      "display_name": "Zyra",
      "title": ", Rise of the Thorns",
      "lore_snippet": "Born in an ancient, sorcerous catastrophe, Zyra is the wrath of nature given form—an alluring hybrid of plant and human, kindling new life with every step. She views the many mortals of Valoran as little more than prey for her seeded progeny, and thinks nothing of slaying them with flurries of deadly spines. Though her true purpose has not been revealed, Zyra wanders the world, indulging her most primal urges to colonize, and strangle all other life from it.\n",
      "type": "Mgic"
    }
  }
]